{
  "settings_title": "Settings",
  "settings_spotify_mode": "Change Spotify Mode",
  "settings_language": "Change Language",
  "settings_coming_soon": "Coming Soon!",
  "settings_modal_select_language": "Select Language",
  "settings_theme_label": "App appearance",
  "settings_theme_hint": "Switch between light and dark vibes anytime.",
  "settings_theme_light": "Light",
  "settings_theme_dark": "Dark",
  "settings_toggle_on": "On",
  "settings_toggle_off": "Off",
  "settings_spotify_mode_title": "Spotify Premium?",
  "settings_spotify_mode_subtitle": "Choose Spotify Free if you don't have a paid Spotify account. Otherwise, choose Spotify Premium for a better experience. For more information, visit spotify.com.",
  "settings_spotify_mode_free": "Spotify Free",
  "settings_spotify_mode_premium": "Spotify Premium",
  "language_selection": "Select Language",
  "not_found_title": "Oops!",
  "not_found_message": "This screen doesn't exist.",
  "not_found_link": "Go to home screen!",
  "camera_loading_permissions": "Loading permissions...",
  "camera_permission_text": "We need camera permission to use this feature.",
  "camera_grant_permission": "Grant Permission",
  "camera_flip_camera": "Flip Camera",
  "game_rules_header": "TuneTrack Game Rules",
  "game_rules_intro_title": "Get the Party Started!",
  "game_rules_intro_content": "Experience over 100 years of music history! Players take turns building their own timeline by placing songs in chronological order. It's a fun journey through musical memories!",
  "game_rules_intro_additional": "You can all play at the same difficulty level, or mix it up by letting each player choose their own level for an extra challenge!",
  "game_rules_difficulty_title": "Choose Your Challenge",
  "game_rules_difficulty_instant": "Instant Party: Perfect for beginners! Simply arrange the songs in order without needing to identify them.",
  "game_rules_difficulty_original": "Original: For music lovers! You need to identify both the artist and the song title.",
  "game_rules_difficulty_pro": "Pro: For true music fans! You should know the song title, artist, and roughly when it was released.",
  "game_rules_difficulty_expert": "Expert: The ultimate challenge! You must know the artist, song title, and the exact release year.",
  "game_rules_difficulty_cooperative": "Cooperative: Work together as a team to build one shared timeline!",
  "game_rules_original_title": "Original Mode – Basic Rules",
  "game_rules_original_step1": "Setup: First, decide if you're playing solo or in teams. Everyone gets 2 tokens and 1 starting card (with the date showing) to begin their timeline.",
  "game_rules_original_step2": "Choose Your DJ: If you have Spotify Premium, one person can easily play songs for everyone. With Spotify Free or other services, either pick one DJ or take turns scanning cards.",
  "game_rules_original_step3": "Play the Song: The DJ scans the card using the TuneTrack app, and the song starts playing.",
  "game_rules_original_step4": "Place Your Card: The player sitting to the DJ's left decides where the card belongs on their timeline – before an earlier song, after a later one, or between two cards.",
  "game_rules_original_step5": "Check Your Answer: Flip the card to see if you're right! Correct placement means you keep the card. Wrong? Discard it – unless someone used a token to challenge your placement. Win by collecting 10 correct cards!",
  "game_rules_pro_title": "Pro Mode – What's Different?",
  "game_rules_pro_content1": "In Pro mode, you don't need the exact year, but you must correctly identify both the artist and song title. Everything else works the same as Original mode.",
  "game_rules_pro_content2": "Pro players start with 5 tokens. You can only keep a card if you correctly name both the artist and title. The same rule applies when trying to steal cards from other players.",
  "game_rules_pro_content3": "You won't earn extra tokens during the game – you only get the 5 you start with, so use them wisely!",
  "game_rules_expert_title": "Expert Mode – The Ultimate Test",
  "game_rules_expert_content1": "Expert mode is the toughest challenge! You need to know the song title, artist, AND the exact release year. Say all three out loud when placing your card.",
  "game_rules_expert_content2": "Expert players start with just 3 tokens. If you can't name the song, artist, and year correctly, you lose the card.",
  "game_rules_expert_content3": "Token rules work the same as Original mode, but when stealing a card, you must also correctly identify the artist, title, and year.",
  "game_rules_cooperative_title": "Cooperative Mode – Team Up!",
  "game_rules_cooperative_content1": "Not in the mood to compete? Try cooperative mode! Everyone works together as one team to build a single shared timeline.",
  "game_rules_cooperative_content2": "Your team gets 5 tokens and one starting card (date side up). Work together to place each new card correctly. Right placement keeps the card; wrong placement costs you a token.",
  "game_rules_cooperative_content3": "Your goal is to collect 10 cards before running out of tokens!",
  "game_rules_tokens_title": "Using Tokens",
  "game_rules_tokens_intro": "Tokens add strategy and excitement to the game! You can use anything as tokens – coins, pieces of cardboard, buttons, or anything else you have handy. Tokens can be used in three ways:",
  "game_rules_tokens_own_turn_title": "1. Skip a Song",
  "game_rules_tokens_own_turn": "Stuck on a song you don't recognize? Spend 1 token to skip it! Scan the next card to get a new song. Discard both the token and the skipped card.",
  "game_rules_tokens_opponent_turn_title": "2. Challenge an Opponent",
  "game_rules_tokens_opponent_turn": "Think someone placed their card in the wrong spot? Shout \"TuneTrack\" before they flip their card! Place one of your tokens on their timeline where you think the card should actually go. If you're right, you steal the card and add it to your own timeline in the correct position. Discard your used token.",
  "game_rules_tokens_opponent_note": "Important: The first person to shout \"TuneTrack\" gets to place their token first. If another player also thinks the placement is wrong, they can shout \"TuneTrack\" too and place their token on a different spot. Only one token can be placed on each spot of an opponent's timeline.",
  "game_rules_tokens_anytime_title": "3. Buy a Card",
  "game_rules_tokens_anytime": "Trade 3 tokens to take the top card from the deck and add it directly to your timeline – no guessing required! This is perfect when you're confident about a song's position.",
  "game_rules_tokens_earning_title": "Earning Tokens",
  "game_rules_tokens_earning": "During your turn, you earn 1 token when you correctly name both the song title and artist. You get the token even if you placed the card in the wrong position on your timeline. Remember: you can never have more than 5 tokens at once!",
  "index_read_rules": "Read Game Rules",
  "index_start_game": "Start Game",
  "index_connect_spotify": "Connect to Spotify",
  "index_logo": "TuneTrack",
  "qr_result_swipe_instruction": "Swipe to scan the next card",
  "qr_result_back": "Back",
  "spotify_connect_title": "Connect to Spotify",
  "spotify_connect_subtitle": "Before proceeding, install the latest version of the Spotify app on this device.",
  "spotify_connect_connect": "Connect to Spotify",
  "spotify_connect_already": "You're already logged in. Tap here to continue.",
  "warning_title": "WARNING!",
  "warning_text": "TuneTrack requires an internet connection to stream music to your device. Make sure you're connected to secure Wi-Fi to avoid additional charges.",
  "warning_ok": "I Understand",
  "button_generic_back": "Back",
  "camera_align_instruction": "Align the QR code inside the frame",
  "settings_animation_toggle_label": "Animations",
  "settings_animation_toggle_hint": "Turn this off to disable all animations in the app and save battery.",
  "spotify_connect_error_title": "Spotify login failed",
  "spotify_connect_connecting": "Connecting...",
  "ok": "OK",
  "language_name_english": "English",
  "language_name_hungarian": "Magyar",
  "qr_result_explicit_tag": "Explicit",
  "qr_result_playing_now": "Playing now",
  "qr_result_artist_unknown": "Spotify Track",
  "qr_result_hide_now_playing": "Hide now playing",
  "qr_result_show_now_playing": "Show now playing",
  "qr_result_details_button": "Song details",
  "qr_result_copy_button": "Copy link",
  "qr_result_share_button": "Share link",
  "qr_result_open_spotify_button": "Open in Spotify",
  "qr_result_next_scan_button": "Scan next QR",
  "qr_result_next_scan_hint": "Stops playback and opens the camera",
  "qr_result_details_title": "Spotify track",
  "qr_result_details_loading": "Loading details",
  "please_wait": "Please wait a moment",
  "qr_result_details_unavailable_title": "Song details unavailable",
  "qr_result_details_unavailable_message": "We could not fetch more info from Spotify just yet.",
  "qr_result_copy_success_title": "Link copied",
  "qr_result_copy_success_message": "The Spotify link is ready to paste.",
  "qr_result_copy_error_title": "Copy failed",
  "qr_result_copy_error_message": "We could not copy the link. Please try again.",
  "qr_result_error_title": "Error",
  "qr_result_error_no_uri": "No Spotify URI found in QR Code.",
  "qr_result_error_qr_title": "QR Code",
  "qr_result_error_not_recognized": "Not recognized as a Spotify track URI",
  "qr_result_track_position_of": "Track {{number}} of {{total}}",
  "qr_result_track_position": "Track {{number}}",
  "qr_result_detail_release": "Release",
  "qr_result_detail_duration": "Duration",
  "qr_result_detail_popularity": "Popularity",
  "qr_result_detail_overview": "Overview",
  "qr_result_detail_album": "Album",
  "qr_result_detail_track_number": "Track",
  "qr_result_detail_link": "Spotify link"
}
