{
  "settings_title": "Beállítások",
  "settings_spotify_mode": "Spotify mód módosítása",
  "settings_language": "Nyelv módosítása",
  "settings_coming_soon": "Hamarosan!",
  "settings_modal_select_language": "Nyelv kiválasztása",
  "settings_theme_label": "Megjelenés",
  "settings_theme_hint": "Válts világos és sötét paletták között bármikor.",
  "settings_theme_light": "Világos",
  "settings_theme_dark": "Sötét",
  "settings_toggle_on": "Be",
  "settings_toggle_off": "Ki",
  "settings_spotify_mode_title": "Spotify Premium?",
  "settings_spotify_mode_subtitle": "Válaszd a Spotify Free-t, ha nincs fizetős Spotify fiókod. Más esetben a jobb élmény érdekében válaszd a Spotify Premium-ot. További tájékoztatásért látogass el a spotify.com-ra.",
  "settings_spotify_mode_free": "Spotify Free",
  "settings_spotify_mode_premium": "Spotify Premium",
  "language_selection": "Nyelv kiválasztása",
  "not_found_title": "Oops!",
  "not_found_message": "Ez a képernyő nem létezik.",
  "not_found_link": "Menj a kezdőképernyőre!",
  "camera_loading_permissions": "Engedélyek betöltése...",
  "camera_permission_text": "A funkció használatához kameraengedélyre van szükség.",
  "camera_grant_permission": "Engedélyezés",
  "camera_flip_camera": "Kamera váltása",
  "game_rules_header": "TuneTrack Játékszabályok",
  "game_rules_intro_title": "Indítsd el a bulit!",
  "game_rules_intro_content": "Fedezd fel több mint 100 év zenei történetét! A játékosok felváltva építik fel saját idővonalukat, a dalokat időrendi sorrendben elhelyezve. Egy izgalmas utazás a zenei emlékek között!",
  "game_rules_intro_additional": "Mindenki ugyanazon a nehézségi szinten játszhat, vagy keverhetitek is – minden játékos választhat saját szintet a nagyobb kihívásért!",
  "game_rules_difficulty_title": "Válaszd a kihívást",
  "game_rules_difficulty_instant": "Instant Party: Kezdőknek tökéletes! Egyszerűen csak időrendben helyezd el a dalokat, nem kell felismerned őket.",
  "game_rules_difficulty_original": "Original: Zeneimádóknak! Az előadót és a szám címét is fel kell ismerned.",
  "game_rules_difficulty_pro": "Pro: Igazi zenebarátoknak! Tudnod kell a szám címét, előadóját, és nagyjából mikor jelent meg.",
  "game_rules_difficulty_expert": "Expert: A végső kihívás! Az előadót, a szám címét ÉS a pontos megjelenési évet is tudnod kell.",
  "game_rules_difficulty_cooperative": "Kooperatív: Dolgozzatok együtt csapatként, és építsetek egy közös idővonalat!",
  "game_rules_original_title": "Original Mód – Alapszabályok",
  "game_rules_original_step1": "Előkészület: Először döntsétek el, egyénileg vagy csapatban játszotok. Mindenki kap 2 zsetont és 1 kezdő kártyát (dátum oldallal felfelé) az idővonal kezdéséhez.",
  "game_rules_original_step2": "DJ választása: Ha Spotify Premiumotok van, egy személy könnyedén lejátszhatja a dalokat mindenkinek. Spotify Free vagy más szolgáltatás esetén vagy válasszatok egy DJ-t, vagy felváltva olvassátok be a kártyákat.",
  "game_rules_original_step3": "Dal lejátszása: A DJ beolvassa a kártyát a TuneTrack alkalmazással, és a dal elindul.",
  "game_rules_original_step4": "Kártya elhelyezése: A DJ balján ülő játékos dönti el, hova kerüljön a kártya az idővonalán – egy korábbi dal elé, egy későbbi mögé, vagy két kártya közé.",
  "game_rules_original_step5": "Válasz ellenőrzése: Fordítsd meg a kártyát, hogy megnézd, helyes voltál-e! Helyes elhelyezés esetén megtartod a kártyát. Rossz? Dobd el – kivéve, ha valaki zsetonnal kihívta az elhelyezésedet. 10 helyes kártya gyűjtésével nyersz!",
  "game_rules_pro_title": "Pro Mód – Mi a különbség?",
  "game_rules_pro_content1": "Pro módban nem kell a pontos évet tudnod, de az előadót és a szám címét helyesen kell azonosítanod. Minden más ugyanúgy működik, mint az Original módban.",
  "game_rules_pro_content2": "A Pro játékosok 5 zsetonnal kezdenek. Csak akkor tarthatod meg a kártyát, ha helyesen nevezted meg az előadót és a címet. Ugyanez a szabály vonatkozik, amikor más játékosoktól próbálsz kártyát lopni.",
  "game_rules_pro_content3": "A játék során nem kapsz extra zsetonokat – csak az 5 kezdő zsetonod marad, úgyhogy használd őket okosan!",
  "game_rules_expert_title": "Expert Mód – A Végső Próba",
  "game_rules_expert_content1": "Az Expert mód a legnehezebb kihívás! A szám címét, előadóját ÉS a pontos megjelenési évet is tudnod kell. Mindhármat hangosan mondd ki, amikor elhelyezed a kártyát.",
  "game_rules_expert_content2": "Az Expert játékosok csak 3 zsetonnal kezdenek. Ha nem tudod helyesen megnevezni a számot, előadót és évet, elveszíted a kártyát.",
  "game_rules_expert_content3": "A zsetonszabályok ugyanúgy működnek, mint az Original módban, de amikor kártyát lopsz, az előadót, címet és évet is helyesen kell azonosítanod.",
  "game_rules_cooperative_title": "Kooperatív Mód – Csapatban!",
  "game_rules_cooperative_content1": "Nincs kedved versenyezni? Próbáld ki a kooperatív módot! Mindenki együtt dolgozik egy csapatként, hogy egy közös idővonalat építsenek.",
  "game_rules_cooperative_content2": "A csapatotok 5 zsetont és egy kezdő kártyát kap (dátum oldallal felfelé). Dolgozzatok együtt, hogy minden új kártyát helyesen helyezzetek el. Helyes elhelyezés megtartja a kártyát; rossz elhelyezés egy zsetont veszít el.",
  "game_rules_cooperative_content3": "A célotok, hogy 10 kártyát gyűjtsetek össze, mielőtt elfogynának a zsetonjaitok!",
  "game_rules_tokens_title": "Zsetonok Használata",
  "game_rules_tokens_intro": "A zsetonok stratégiai elemet és izgalmat adnak a játékhoz! Bármit használhatsz zsetonként – érméket, karton darabokat, gombokat, vagy bármi mást, ami kéznél van. A zsetonok háromféleképpen használhatók:",
  "game_rules_tokens_own_turn_title": "1. Szám Kihagyása",
  "game_rules_tokens_own_turn": "Nem ismered fel a számot? Fizess 1 zsetont, hogy kihagyd! Olvasd be a következő kártyát egy új számért. Dobd el mind a zsetont, mind a kihagyott kártyát.",
  "game_rules_tokens_opponent_turn_title": "2. Ellenfél Kihívása",
  "game_rules_tokens_opponent_turn": "Azt gondolod, hogy valaki rossz helyre tette a kártyáját? Kiáltsd, hogy \"TuneTrack\", mielőtt megfordítanák a kártyát! Helyezz egy zsetonodat az ellenfeled idővonalára, oda, ahol szerinted a kártyának kellene lennie. Ha igazad van, ellopod a kártyát, és hozzáadod a saját idővonaladhoz a helyes pozícióba. Dobd el a használt zsetont.",
  "game_rules_tokens_opponent_note": "Fontos: Az első, aki \"TuneTrack\"-ot kiált, az kapja meg a jogot, hogy először helyezze el a zsetonját. Ha egy másik játékos is úgy gondolja, hogy az elhelyezés rossz, ő is kiálthatja a \"TuneTrack\"-ot, és elhelyezheti a zsetonját egy másik helyen. Az ellenfél idővonalának minden helyére csak egy zseton helyezhető.",
  "game_rules_tokens_anytime_title": "3. Kártya Vásárlása",
  "game_rules_tokens_anytime": "Cserélj be 3 zsetont, hogy vedd a pakli tetején lévő kártyát, és add hozzá közvetlenül az idővonaladhoz – nincs tippelés! Ez tökéletes, amikor biztos vagy egy szám pozíciójában.",
  "game_rules_tokens_earning_title": "Zsetonok Szerzése",
  "game_rules_tokens_earning": "A saját körödben 1 zsetont kapsz, amikor helyesen nevezed meg a szám címét és az előadót. A zsetont akkor is megkapod, ha rossz helyre tetted a kártyát az idővonalon. Ne feledd: soha nem lehet több, mint 5 zsetonod egyszerre!",
  "index_read_rules": "A játékszabály elolvasása",
  "index_start_game": "Játék indítása",
  "index_connect_spotify": "Csatlakozás a Spotify-hoz",
  "index_logo": "TuneTrack",
  "qr_result_swipe_instruction": "Húzd félre a következő kártya beolvasásához",
  "qr_result_back": "Vissza",
  "spotify_connect_title": "Csatlakozás a Spotify-hoz",
  "spotify_connect_subtitle": "A továbblépés előtt telepítsd fel a Spotify Alkalmazás legfrissebb változatát erre az eszközre.",
  "spotify_connect_connect": "Csatlakozás a Spotify-hoz",
  "spotify_connect_already": "Már be vagy jelentkezve. Kattints ide a folytatáshoz.",
  "warning_title": "FIGYELEM!",
  "warning_text": "A TuneTrack alkalmazás internet kapcsolatot igényel, hogy zenét streameljen az eszközödre. Bizonyosodj meg róla, hogy biztonságos Wi-Fi kapcsolatot használsz, hogy elkerüld a plusz költségeket.",
  "warning_ok": "Értem",
  "button_generic_back": "Vissza",
  "camera_align_instruction": "Igazítsd a QR kódot a keretbe",
  "settings_animation_toggle_label": "Animációk",
  "settings_animation_toggle_hint": "Kapcsold ki az alkalmazásban lévő összes animáció kikapcsolásához és az akkumulátor megtakarításához.",
  "spotify_connect_error_title": "Spotify bejelentkezés sikertelen",
  "spotify_connect_connecting": "Csatlakozás...",
  "ok": "OK",
  "language_name_english": "English",
  "language_name_hungarian": "Magyar",
  "qr_result_explicit_tag": "Explicit",
  "qr_result_playing_now": "Most játszik",
  "qr_result_artist_unknown": "Spotify szám",
  "qr_result_hide_now_playing": "Elrejtés",
  "qr_result_show_now_playing": "Most játszik mutatása",
  "qr_result_details_button": "Részletek",
  "qr_result_copy_button": "Link másolása",
  "qr_result_share_button": "Link megosztása",
  "qr_result_open_spotify_button": "Megnyitás a Spotifyban",
  "qr_result_next_scan_button": "Következő QR beolvasása",
  "qr_result_next_scan_hint": "Leállítja a lejátszást és megnyitja a kamerát",
  "qr_result_details_title": "Spotify szám",
  "qr_result_details_loading": "Részletek betöltése",
  "please_wait": "Kérlek várj egy pillanatot",
  "qr_result_details_unavailable_title": "Részletek nem elérhetők",
  "qr_result_details_unavailable_message": "Egyelőre nem sikerült további információt lekérni a Spotifyról.",
  "qr_result_copy_success_title": "Link másolva",
  "qr_result_copy_success_message": "A Spotify link készen áll a beillesztésre.",
  "qr_result_copy_error_title": "Másolás sikertelen",
  "qr_result_copy_error_message": "Nem sikerült a linket másolni. Kérlek próbáld újra.",
  "qr_result_error_title": "Hiba",
  "qr_result_error_no_uri": "Nem található Spotify URI a QR kódban.",
  "qr_result_error_qr_title": "QR kód",
  "qr_result_error_not_recognized": "Nem felismerhető Spotify szám URI",
  "qr_result_track_position_of": "{{number}}. szám a(z) {{total}} közül",
  "qr_result_track_position": "{{number}}. szám",
  "qr_result_detail_release": "Megjelenés",
  "qr_result_detail_duration": "Hossz",
  "qr_result_detail_popularity": "Népszerűség",
  "qr_result_detail_overview": "Áttekintés",
  "qr_result_detail_album": "Album",
  "qr_result_detail_track_number": "Szám",
  "qr_result_detail_link": "Spotify link"
}
